-----------------------------------------------------
Created on: 30-08-2022                              
Author: Rohit Sharma                                
                                                     
-----------------------------------------------------

# PySpark Handling Missing Values
* Dropping cloumns
* Dropping rows
* Various paramter in dropping functionalities
* Handling Missing values by Mean, Median and Mode

In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.appName("Practice").getOrCreate()

In [3]:
df_spark = spark.read.csv("test2.csv", header=True, inferSchema=True)

In [4]:
df_spark.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|    Ram|  28|         1| 10000|
|  Rohan|  27|         3| 30000|
|  Mohan|  25|         4| 40000|
|    Raj|  20|         2| 20000|
|   Neha|  24|         2| 20000|
|Prateek|  23|         5| 50000|
|  Mukul|  26|         3| 30000|
|  Disha|null|      null| 50000|
|  Namit|  27|         6| 60000|
|   null|  34|      null|  null|
|   null|  36|        10|  null|
+-------+----+----------+------+

In [6]:
# Drop columns
df_spark.drop("Name").show()

+----+----------+------+
| Age|Experience|Salary|
+----+----------+------+
|  28|         1| 10000|
|  27|         3| 30000|
|  25|         4| 40000|
|  20|         2| 20000|
|  24|         2| 20000|
|  23|         5| 50000|
|  26|         3| 30000|
|null|      null| 50000|
|  27|         6| 60000|
|  34|      null|  null|
|  36|        10|  null|
+----+----------+------+

In [7]:
# Drop rows
df_spark.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|    Ram|  28|         1| 10000|
|  Rohan|  27|         3| 30000|
|  Mohan|  25|         4| 40000|
|    Raj|  20|         2| 20000|
|   Neha|  24|         2| 20000|
|Prateek|  23|         5| 50000|
|  Mukul|  26|         3| 30000|
|  Disha|null|      null| 50000|
|  Namit|  27|         6| 60000|
|   null|  34|      null|  null|
|   null|  36|        10|  null|
+-------+----+----------+------+

In [8]:
df_spark.na.drop().show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|    Ram| 28|         1| 10000|
|  Rohan| 27|         3| 30000|
|  Mohan| 25|         4| 40000|
|    Raj| 20|         2| 20000|
|   Neha| 24|         2| 20000|
|Prateek| 23|         5| 50000|
|  Mukul| 26|         3| 30000|
|  Namit| 27|         6| 60000|
+-------+---+----------+------+

In [9]:
# any==how  or all==how
df_spark.na.drop(how='any').show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|    Ram| 28|         1| 10000|
|  Rohan| 27|         3| 30000|
|  Mohan| 25|         4| 40000|
|    Raj| 20|         2| 20000|
|   Neha| 24|         2| 20000|
|Prateek| 23|         5| 50000|
|  Mukul| 26|         3| 30000|
|  Namit| 27|         6| 60000|
+-------+---+----------+------+

In [11]:
# threshold
df_spark.na.drop(how='any', thresh=2).show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|    Ram|  28|         1| 10000|
|  Rohan|  27|         3| 30000|
|  Mohan|  25|         4| 40000|
|    Raj|  20|         2| 20000|
|   Neha|  24|         2| 20000|
|Prateek|  23|         5| 50000|
|  Mukul|  26|         3| 30000|
|  Disha|null|      null| 50000|
|  Namit|  27|         6| 60000|
|   null|  36|        10|  null|
+-------+----+----------+------+

In [12]:
# subset
df_spark.na.drop(how='any', subset=['Experience']).show()   #drop nan values only from a specific column

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|    Ram| 28|         1| 10000|
|  Rohan| 27|         3| 30000|
|  Mohan| 25|         4| 40000|
|    Raj| 20|         2| 20000|
|   Neha| 24|         2| 20000|
|Prateek| 23|         5| 50000|
|  Mukul| 26|         3| 30000|
|  Namit| 27|         6| 60000|
|   null| 36|        10|  null|
+-------+---+----------+------+

In [23]:
# Fill the missing values
df_spark.na.fill('Missing Values', ['Name', 'Age']).show()

+--------------+----+----------+------+
|          Name| Age|Experience|Salary|
+--------------+----+----------+------+
|           Ram|  28|         1| 10000|
|         Rohan|  27|         3| 30000|
|         Mohan|  25|         4| 40000|
|           Raj|  20|         2| 20000|
|          Neha|  24|         2| 20000|
|       Prateek|  23|         5| 50000|
|         Mukul|  26|         3| 30000|
|         Disha|null|      null| 50000|
|         Namit|  27|         6| 60000|
|Missing Values|  34|      null|  null|
|Missing Values|  36|        10|  null|
+--------------+----+----------+------+

In [24]:
df_spark.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|    Ram|  28|         1| 10000|
|  Rohan|  27|         3| 30000|
|  Mohan|  25|         4| 40000|
|    Raj|  20|         2| 20000|
|   Neha|  24|         2| 20000|
|Prateek|  23|         5| 50000|
|  Mukul|  26|         3| 30000|
|  Disha|null|      null| 50000|
|  Namit|  27|         6| 60000|
|   null|  34|      null|  null|
|   null|  36|        10|  null|
+-------+----+----------+------+

In [31]:
# Mean, Median, Mode
from pyspark.ml.feature import Imputer

imputer = Imputer(
     inputCols=['Age', 'Experience', 'Salary'],
     outputCols=["{}_imputed".format(c) for c in ['Age', 'Experience', 'Salary']]).setStrategy("mean") # change for median or mode

In [32]:
#add imputation cols to df
imputer.fit(df_spark).transform(df_spark).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|    Ram|  28|         1| 10000|         28|                 1|         10000|
|  Rohan|  27|         3| 30000|         27|                 3|         30000|
|  Mohan|  25|         4| 40000|         25|                 4|         40000|
|    Raj|  20|         2| 20000|         20|                 2|         20000|
|   Neha|  24|         2| 20000|         24|                 2|         20000|
|Prateek|  23|         5| 50000|         23|                 5|         50000|
|  Mukul|  26|         3| 30000|         26|                 3|         30000|
|  Disha|null|      null| 50000|         27|                 4|         50000|
|  Namit|  27|         6| 60000|         27|                 6|         60000|
|   null|  34|      null|  null|         34|                 4|         34444|
|   null|  36|        10|  null|         36|                10|         34444|
+-------+----+----------+------+-----------+------------------+--------------+